Microchip-MPLAB-Harmony/smartenergy/apps/metering_demo_freertos/firmware/src/packs/PIC32CX2051MTC128_DFP/component/matrix.h
/* -------- MATRIX_PASSR : (MATRIX Offset: 0x240) (R/W 32) Protected Areas Split Slave 0 Register -------- */
#define MATRIX_PASSR_PASPLIT0_Pos             _UINT32_(0)                                          /* (MATRIX_PASSR) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR_PASPLIT0_Msk             (_UINT32_(0xF) << MATRIX_PASSR_PASPLIT0_Pos)         /* (MATRIX_PASSR) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR_PASPLIT0(value)          (MATRIX_PASSR_PASPLIT0_Msk & (_UINT32_(value) << MATRIX_PASSR_PASPLIT0_Pos)) /* Assigment of value for PASPLIT0 in the MATRIX_PASSR register */
#define MATRIX_PASSR_PASPLIT1_Pos             _UINT32_(4)                                          /* (MATRIX_PASSR) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR_PASPLIT1_Msk             (_UINT32_(0xF) << MATRIX_PASSR_PASPLIT1_Pos)         /* (MATRIX_PASSR) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR_PASPLIT1(value)          (MATRIX_PASSR_PASPLIT1_Msk & (_UINT32_(value) << MATRIX_PASSR_PASPLIT1_Pos)) /* Assigment of value for PASPLIT1 in the MATRIX_PASSR register */
#define MATRIX_PASSR_PASPLIT2_Pos             _UINT32_(8)                                          /* (MATRIX_PASSR) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR_PASPLIT2_Msk             (_UINT32_(0xF) << MATRIX_PASSR_PASPLIT2_Pos)         /* (MATRIX_PASSR) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR_PASPLIT2(value)          (MATRIX_PASSR_PASPLIT2_Msk & (_UINT32_(value) << MATRIX_PASSR_PASPLIT2_Pos)) /* Assigment of value for PASPLIT2 in the MATRIX_PASSR register */
#define MATRIX_PASSR_PASPLIT3_Pos             _UINT32_(12)                                         /* (MATRIX_PASSR) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR_PASPLIT3_Msk             (_UINT32_(0xF) << MATRIX_PASSR_PASPLIT3_Pos)         /* (MATRIX_PASSR) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR_PASPLIT3(value)          (MATRIX_PASSR_PASPLIT3_Msk & (_UINT32_(value) << MATRIX_PASSR_PASPLIT3_Pos)) /* Assigment of value for PASPLIT3 in the MATRIX_PASSR register */
#define MATRIX_PASSR_PASPLIT4_Pos             _UINT32_(16)                                         /* (MATRIX_PASSR) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR_PASPLIT4_Msk             (_UINT32_(0xF) << MATRIX_PASSR_PASPLIT4_Pos)         /* (MATRIX_PASSR) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR_PASPLIT4(value)          (MATRIX_PASSR_PASPLIT4_Msk & (_UINT32_(value) << MATRIX_PASSR_PASPLIT4_Pos)) /* Assigment of value for PASPLIT4 in the MATRIX_PASSR register */
#define MATRIX_PASSR_PASPLIT5_Pos             _UINT32_(20)                                         /* (MATRIX_PASSR) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR_PASPLIT5_Msk             (_UINT32_(0xF) << MATRIX_PASSR_PASPLIT5_Pos)         /* (MATRIX_PASSR) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR_PASPLIT5(value)          (MATRIX_PASSR_PASPLIT5_Msk & (_UINT32_(value) << MATRIX_PASSR_PASPLIT5_Pos)) /* Assigment of value for PASPLIT5 in the MATRIX_PASSR register */
#define MATRIX_PASSR_PASPLIT6_Pos             _UINT32_(24)                                         /* (MATRIX_PASSR) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR_PASPLIT6_Msk             (_UINT32_(0xF) << MATRIX_PASSR_PASPLIT6_Pos)         /* (MATRIX_PASSR) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR_PASPLIT6(value)          (MATRIX_PASSR_PASPLIT6_Msk & (_UINT32_(value) << MATRIX_PASSR_PASPLIT6_Pos)) /* Assigment of value for PASPLIT6 in the MATRIX_PASSR register */
#define MATRIX_PASSR_PASPLIT7_Pos             _UINT32_(28)                                         /* (MATRIX_PASSR) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR_PASPLIT7_Msk             (_UINT32_(0xF) << MATRIX_PASSR_PASPLIT7_Pos)         /* (MATRIX_PASSR) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR_PASPLIT7(value)          (MATRIX_PASSR_PASPLIT7_Msk & (_UINT32_(value) << MATRIX_PASSR_PASPLIT7_Pos)) /* Assigment of value for PASPLIT7 in the MATRIX_PASSR register */
#define MATRIX_PASSR_Msk                      _UINT32_(0xFFFFFFFF)                                 /* (MATRIX_PASSR) Register Mask  */


/* -------- MATRIX_PRTSR : (MATRIX Offset: 0x280) (R/W 32) Protected Region Top Slave 0 Register -------- */
#define MATRIX_PRTSR_PRTOP0_Pos               _UINT32_(0)                                          /* (MATRIX_PRTSR) HSELx Protected Region Top Position */
#define MATRIX_PRTSR_PRTOP0_Msk               (_UINT32_(0xF) << MATRIX_PRTSR_PRTOP0_Pos)           /* (MATRIX_PRTSR) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR_PRTOP0(value)            (MATRIX_PRTSR_PRTOP0_Msk & (_UINT32_(value) << MATRIX_PRTSR_PRTOP0_Pos)) /* Assigment of value for PRTOP0 in the MATRIX_PRTSR register */
#define MATRIX_PRTSR_PRTOP1_Pos               _UINT32_(4)                                          /* (MATRIX_PRTSR) HSELx Protected Region Top Position */
#define MATRIX_PRTSR_PRTOP1_Msk               (_UINT32_(0xF) << MATRIX_PRTSR_PRTOP1_Pos)           /* (MATRIX_PRTSR) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR_PRTOP1(value)            (MATRIX_PRTSR_PRTOP1_Msk & (_UINT32_(value) << MATRIX_PRTSR_PRTOP1_Pos)) /* Assigment of value for PRTOP1 in the MATRIX_PRTSR register */
#define MATRIX_PRTSR_PRTOP2_Pos               _UINT32_(8)                                          /* (MATRIX_PRTSR) HSELx Protected Region Top Position */
#define MATRIX_PRTSR_PRTOP2_Msk               (_UINT32_(0xF) << MATRIX_PRTSR_PRTOP2_Pos)           /* (MATRIX_PRTSR) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR_PRTOP2(value)            (MATRIX_PRTSR_PRTOP2_Msk & (_UINT32_(value) << MATRIX_PRTSR_PRTOP2_Pos)) /* Assigment of value for PRTOP2 in the MATRIX_PRTSR register */
#define MATRIX_PRTSR_PRTOP3_Pos               _UINT32_(12)                                         /* (MATRIX_PRTSR) HSELx Protected Region Top Position */
#define MATRIX_PRTSR_PRTOP3_Msk               (_UINT32_(0xF) << MATRIX_PRTSR_PRTOP3_Pos)           /* (MATRIX_PRTSR) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR_PRTOP3(value)            (MATRIX_PRTSR_PRTOP3_Msk & (_UINT32_(value) << MATRIX_PRTSR_PRTOP3_Pos)) /* Assigment of value for PRTOP3 in the MATRIX_PRTSR register */
#define MATRIX_PRTSR_PRTOP4_Pos               _UINT32_(16)                                         /* (MATRIX_PRTSR) HSELx Protected Region Top Position */
#define MATRIX_PRTSR_PRTOP4_Msk               (_UINT32_(0xF) << MATRIX_PRTSR_PRTOP4_Pos)           /* (MATRIX_PRTSR) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR_PRTOP4(value)            (MATRIX_PRTSR_PRTOP4_Msk & (_UINT32_(value) << MATRIX_PRTSR_PRTOP4_Pos)) /* Assigment of value for PRTOP4 in the MATRIX_PRTSR register */
#define MATRIX_PRTSR_PRTOP5_Pos               _UINT32_(20)                                         /* (MATRIX_PRTSR) HSELx Protected Region Top Position */
#define MATRIX_PRTSR_PRTOP5_Msk               (_UINT32_(0xF) << MATRIX_PRTSR_PRTOP5_Pos)           /* (MATRIX_PRTSR) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR_PRTOP5(value)            (MATRIX_PRTSR_PRTOP5_Msk & (_UINT32_(value) << MATRIX_PRTSR_PRTOP5_Pos)) /* Assigment of value for PRTOP5 in the MATRIX_PRTSR register */
#define MATRIX_PRTSR_PRTOP6_Pos               _UINT32_(24)                                         /* (MATRIX_PRTSR) HSELx Protected Region Top Position */
#define MATRIX_PRTSR_PRTOP6_Msk               (_UINT32_(0xF) << MATRIX_PRTSR_PRTOP6_Pos)           /* (MATRIX_PRTSR) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR_PRTOP6(value)            (MATRIX_PRTSR_PRTOP6_Msk & (_UINT32_(value) << MATRIX_PRTSR_PRTOP6_Pos)) /* Assigment of value for PRTOP6 in the MATRIX_PRTSR register */
#define MATRIX_PRTSR_PRTOP7_Pos               _UINT32_(28)                                         /* (MATRIX_PRTSR) HSELx Protected Region Top Position */
#define MATRIX_PRTSR_PRTOP7_Msk               (_UINT32_(0xF) << MATRIX_PRTSR_PRTOP7_Pos)           /* (MATRIX_PRTSR) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR_PRTOP7(value)            (MATRIX_PRTSR_PRTOP7_Msk & (_UINT32_(value) << MATRIX_PRTSR_PRTOP7_Pos)) /* Assigment of value for PRTOP7 in the MATRIX_PRTSR register */
#define MATRIX_PRTSR_Msk                      _UINT32_(0xFFFFFFFF)                                 /* (MATRIX_PRTSR) Register Mask  */


